#include <iostream>

using namespace std;

int main()
{
        // اولین روش برای من وارد کردن متغییر و چاپ آن بود
        int number = 2147483647;
        cout << number;
        // روش اولم به این صورت بود که ۱۰ میلیارد بازه در نظر گرفتم و تا
        // یکان آمدم تا به ۲ میلیاردو خورده ای رسیدم حتی اگر
        // یکان ۷ را ۸ کنید عدد منفی این را چاپ میکند
        //به نظرم این یکی از راه ها بود
        //روش دوم سرچ در وب بود
        // که دقیقا همان مقداری که خودم به دست آوردم را در وب در منابع نوشته بودند 2147483647
        //روش آخر هم به شکل زیر است
        int i = 0;
        while(i<=10000000000){
                cout << i << "\n";
                i++;
        }
        //روش بعدی این بود که به کامپیوتر بدهم از 0 تا 10 میلیارد را چاپ کند تا ببینم تا کجا پیش میرود
        //که متاسفانه این کار یکمقدار زیاد طول میکشد به چاپ ۲۷ میلیون که رسید متوقفش کردم
        //راه دیگری به ذهنم نمیرسد
}
